//- Користувач вводить або має два числа. Потрібно знайти та вивести максимальне число з тих двох . Також потрібно врахувати коли введені рівні числа
let a = +prompt("Введіть перше число")
let b = +prompt("Введіть друге число")
if (a>b) {
    console.log`Число ${a} - найбільше`
 }else if (a < b) {
     console.log(`Число ${b} - найбільше`);
 } else {
     console.log("Числа рівні")
 }

//- У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90. Користувач вводить номер квартири просто в змінні або через prompt('') .
//  Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.

 let flat = +prompt("Введіть номер квартири:")

 if (flat >= 1 && flat <= 20) {
    console.log("1 підїзд")
 }else if (flat >= 20 && flat<=48) {
    console.log("2 підїзд")
 }else if (flat >= 48 && flat <= 90) {
     console.log("3 підїзд");
 } else {
     console.log("Ви ввели неправильний номер кварири")
 }

//- Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО
//
 let number = +prompt("Введіть число: ");

if (number === 10) {
     console.log("ВІРНО");
 } else {
     console.log("НЕВІРНО"); }



// Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
// якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 3.
// якщо в змінну записали щось інше, спрацьовує else
//
let x = ("hello");

if (typeof x === "number") {
     console.log(1);
 }else if (typeof x === "string") {
    console.log(2);
 }else if (typeof x==="boolean") {
     console.log(3)
 }else if (typeof x === "object") {
    console.log(4);
} else {
     console.log("another")
 }





